In [8]:

#initial exploration of "links" table

import duckdb, pandas as pd
from pathlib import Path

#create or connect if it already exists
con = duckdb.connect("movielens100K.duckdb")

### initial exploration of the table "links"


 - To know Before:
 - movieId is an identifier for movies used by <https://movielens.org>. E.g., the movie Toy Story has the link <https://movielens.org/movies/1>

 - imdbId is an identifier for movies used by <http://www.imdb.com>. E.g., the movie Toy Story has the link --<http://www.imdb.com/title/tt0114709/>.

 - tmdbId is an identifier for movies used by <https://www.themoviedb.org>. E.g., the movie Toy Story has the link --<https://www.themoviedb.org/movie/862>.

 - the use of the resources listed above is subject to the terms of each provider.

In [9]:
#check the table structure (columns and data types)
con.sql("DESCRIBE links").df()

  column_name column_type null   key default extra
0     movieId      BIGINT  YES  None    None  None
1      imdbId     VARCHAR  YES  None    None  None
2      tmdbId      BIGINT  YES  None    None  None

####  Comment

 - "movieID":  BIGINT;
 - "imdbID": VARCHAR
 - "tmdbID":  BIGINT;

In [10]:
#Ver o tipo de dados de cada coluna
con.sql("PRAGMA table_info('links')").df()

   cid     name     type  notnull dflt_value     pk
0    0  movieId   BIGINT    False       None  False
1    1   imdbId  VARCHAR    False       None  False
2    2   tmdbId   BIGINT    False       None  False

#### Comments

- The column `notnull` (boolean) shows four zero values.  
  - This means the table allows null (NULL) values.  
  - Since the DataFrame was loaded with `read_csv_auto`, DuckDB does not apply NOT NULL constraints.

- The column `dflt_value` shows the default value assigned when no other value is specified during an INSERT.  
  - In datasets imported with `read_csv_auto` (such as MovieLens), this column almost always appears as NULL.

- The column `pk` (boolean) indicates whether the column is part of the table’s primary key.  
  - It is not.

In [ ]:
#check first 10 rows
con.sql("SELECT * FROM links LIMIT 10").df()

   movieId   imdbId  tmdbId
0        1  0114709     862
1        2  0113497    8844
2        3  0113228   15602
3        4  0114885   31357
4        5  0113041   11862
5        6  0113277     949
6        7  0114319   11860
7        8  0112302   45325
8        9  0114576    9091
9       10  0113189     710

In [ ]:
#count total number of rows
con.sql("SELECT COUNT(*) AS total_registos FROM links").df()

   total_registos
0           86537

In [ ]:
#count the number of missing values
con.sql("""
SELECT
    COUNT(*) - COUNT(movieId) AS missing_movieId,
    COUNT(*) - COUNT(imdbID) AS missing_imdbID,
    COUNT(*) - COUNT(tmdbID) AS missing_tmdbID
FROM links
""").df()

   missing_movieId  missing_imdbID  missing_tmdbID
0                0               0             126

#### Fechar a ligação

In [14]:
con.close()
print("Ligação fechada.")

Ligação fechada.